namespace CSharp;

internal class _05 : SampleBase
{
    public override async Task ActionImplement()
    {
        var response = await api.RequestTrAsync(
                "OPT10081" // 주식일봉차트조회요청
                , [("종목코드", "005930"), ("기준일자", string.Empty), ("수정주가구분", "1")] // 입력데이터
                , [] // 가져올 싱글데이터
                , ["일자", "시가", "고가", "저가", "현재가", "거래량"] // 가져올 멀티데이터
                );
        print(response);
    }
}

// Output
/*
tr_cd: OPT10081
입력데이터
| Key          | Value  |
|--------------|--------|
| 종목코드     | 005930 |
| 기준일자     |        |
| 수정주가구분 | 1      |

출력데이터
nErrCode: 0
rsp_msg: 정상처리
cont_key: 2

멀티데이터, Field Count = 6, Row Count = 600
| 일자     | 시가  | 고가  | 저가  | 현재가 | 거래량   |
|----------|-------|-------|-------|--------|----------|
| 20240719 | 85600 | 86100 | 84100 | 84400  | 18569122 |
| 20240718 | 83800 | 86900 | 83800 | 86900  | 24721790 |
| 20240717 | 87100 | 88000 | 86400 | 86700  | 18186490 |
| 20240716 | 86900 | 88000 | 86700 | 87700  | 16166688 |
| 20240715 | 84700 | 87300 | 84100 | 86700  | 25193080 |
| 20240712 | 85900 | 86100 | 84100 | 84400  | 26344386 |
| 20240711 | 88500 | 88800 | 86700 | 87600  | 24677608 |
...
*/