using System.ComponentModel;

namespace CSharp;

[Description("거래대금상위")]
internal class _09 : SampleBase
{
    public override async Task ActionImplement()
    {
        var response = await api.RequestTrAsync(
            "OPT10032" // 거래대금상위요청
            , [
                ("시장구분", "000"), // 000:전체, 001:코스피, 101:코스닥
                ("관리종목포함", "0"), // 0:관리종목 미포함, 1:관리종목 포함
                ]
            , [] // 가져올 싱글데이터
            , ["종목코드", "종목명", "현재순위", "전일순위", "현재가", "전일대비", "등락률", "현재거래량", "전일거래량", "거래대금"] // 가져올 멀티데이터
            );
        print(response);
    }
}

// Output:
/*
tr_cd: OPT10032
입력데이터
| Key          | Value |
|--------------|-------|
| 시장구분     | 000   |
| 관리종목포함 | 0     |

출력데이터
nErrCode: 0
rsp_msg: 정상처리
cont_key: 2

멀티데이터, Field Count = 10, Row Count = 100
| 종목코드 | 종목명                           | 현재순위 | 전일순위 | 현재가   | 전일대비 | 등락률 | 현재거래량 | 전일거래량 | 거래대금 |
|----------|----------------------------------|----------|----------|----------|----------|--------|------------|------------|----------|
| 005930   | 삼성전자                         | 1        | 1        | -84400   | -2500    | -2.88  | 18569122   | 24721790   | 1574018  |
| 000660   | SK하이닉스                       | 2        | 2        | -209500  | -3000    | -1.41  | 4519170    | 8847665    | 949039   |
| 459580   | KODEX CD금리액티브(합성)         | 3        | 6        | +1042615 | +225     | +0.02  | 629551     | 492124     | 656377   |
| 087010   | 펩트론                           | 4        | 36       | +81000   | +17000   | +26.56 | 5539169    | 1947467    | 410828   |
| 122630   | KODEX 레버리지                   | 5        | 10       | -20865   | -500     | -2.34  | 19045349   | 14690804   | 395793   |
| 252670   | KODEX 200선물인버스2X            | 6        | 4        | +1884    | +44      | +2.39  | 199874694  | 288533987  | 377714   |
| 034020   | 두산에너빌리티                   | 7        | 3        | -20200   | -800     | -3.81  | 14963385   | 63401772   | 305220   |
| 082850   | 우리바이오                       | 8        | 382      | +3905    | +900     | +29.95 | 67691821   | 3341396    | 242737   |
...
*/
